In [2]:
import pandas as pd
import os
from pydataset import data

In [3]:
df_iris = data('iris')

In [5]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [7]:
df_iris.shape

(150, 5)

In [8]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [9]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [10]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [13]:
df_google = pd.read_csv('train.csv')

In [14]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [15]:
df_google.shape

(891, 12)

In [16]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [17]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [18]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [20]:
df_google.Sex.unique()

array(['male', 'female'], dtype=object)

In [21]:
df_google.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [22]:
df_excel = pd.read_csv('train.csv')

In [23]:
df_excel_sample = df_excel.head(100)

In [24]:
df_excel.shape[0]

891

In [25]:
df_excel.columns[0:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

In [35]:
df_excel.dtypes[df_excel.dtypes == 'object']

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [40]:
df_excel.dtypes[(df_excel.dtypes == 'int64')|(df_excel.dtypes == 'float64')]

PassengerId      int64
Survived         int64
Pclass           int64
Age            float64
SibSp            int64
Parch            int64
Fare           float64
dtype: object

In [55]:
print(df_excel.PassengerId.max()-df_excel.PassengerId.min())
print(df_excel.Survived.max()-df_excel.Survived.min())
print(df_excel.Pclass.max()-df_excel.Pclass.min())
print(df_excel.Age.max() -df_excel.Age.min())
print(df_excel.SibSp.max()-df_excel.SibSp.min())
print(df_excel.Parch.max()-df_excel.Parch.min())
print(df_excel.Fare.max()-df_excel.Fare.min())

890
1
2
79.58
8
6
512.3292

In [56]:
import acquire

In [77]:
df = acquire.get_iris_data()

In [133]:
def prep_iris(df):
    df = df.drop(columns=['species_id','measurement_id','Unnamed: 0'])
    df.rename(columns={'species_name':'species'},inplace = True)
    dummies = df.select_dtypes(include='object').columns
    dummies = pd.get_dummies(df[dummies])
    df = pd.concat([df, dummies], axis=1)
    return df

In [80]:
df = acquire.get_titanic_data()

In [134]:
def prep_titanic(df):
    df = df.drop(columns=['passenger_id','deck','Unnamed: 0'])
    dummies = df.select_dtypes(include='object').columns
    dummies = pd.get_dummies(df[dummies])
    df = pd.concat([df, dummies], axis=1)
    return df

In [135]:
df = acquire.get_telco_data()

In [139]:
df['total_charges'] = pd.to_numeric(df['total_charges'].str.replace(' ',''))

In [136]:
df.head()

,Unnamed: 0,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,No,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,No,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,Yes,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,Yes,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,No,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [140]:
def prep_telco(df):
    df = df.drop(columns=['Unnamed: 0','payment_type_id', 'internet_service_type_id', 'contract_type_id','customer_id'])
    df['total_charges'] = pd.to_numeric(df['total_charges'].str.replace(' ',''))
    dummies = df.select_dtypes(include='object').columns
    dummies = pd.get_dummies(df[dummies])
    df = pd.concat([df, dummies], axis=1)
    return df

Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.

Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.

Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.

Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.

In [104]:
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

In [145]:
def split_data(df):
    train, val_test = train_test_split(df,test_size=.2,random_state=21)
    validate, test = train_test_split(val_test,test_size=.3,random_state=21)
    return train, validate, test

In [111]:
train, val_test = train_test_split(df,test_size=.8,random_state=21)

In [114]:
df = acquire.get_iris_data()
df = prep_iris(df)

In [118]:
df = acquire.get_iris_data()
df = prep_iris(df)
train_iris, validate_iris, test_iris = split_data(df)

In [121]:
df = acquire.get_titanic_data()
df = prep_titanic(df)
train_titanic, validate_titanic, test_titanic = split_data(df)

In [146]:
df = acquire.get_telco_data()
df = prep_telco(df)
train_telco, validate_telco, test_telco = split_data(df)

In [147]:
df.shape

(7043, 63)

In [148]:
print(train_telco.shape, validate_telco.shape, test_telco.shape)

(5634, 63) (986, 63) (423, 63)

In [129]:
train_telco.columns

Index(['gender', 'senior_citizen', 'partner', 'dependents', 'tenure',
       'phone_service', 'multiple_lines', 'online_security', 'online_backup',
       'device_protection',
       ...
       'contract_type_Month-to-month', 'contract_type_One year',
       'contract_type_Two year', 'internet_service_type_DSL',
       'internet_service_type_Fiber optic', 'internet_service_type_None',
       'payment_type_Bank transfer (automatic)',
       'payment_type_Credit card (automatic)', 'payment_type_Electronic check',
       'payment_type_Mailed check'],
      dtype='object', length=6594)

In [128]:
pd.set_option('display.max_columns', None)